In [1]:
import pandas as pd
import numpy as np

In [3]:
data = pd.DataFrame({
    'key1':list('aabba'),  
    'key2': ['one','two','one','two','one'],  
    'key3':list('abcde'),
    'data1': np.random.randint(1,9,5), 
#     'data1':['1','2','3','4','5'],
    'data2': np.random.randint(1,9,5),
    'data3': np.random.randint(1,9,5)
})  
data

  key1 key2 key3  data1  data2  data3
0    a  one    a      3      7      2
1    a  two    b      8      7      1
2    b  one    c      6      8      1
3    b  two    d      8      8      6
4    a  one    e      6      2      6

In [4]:
datas = data.groupby('key1')
datas

In [5]:
list(datas)

[('a',   key1 key2 key3  data1  data2  data3
  0    a  one    a      3      7      2
  1    a  two    b      8      7      1
  4    a  one    e      6      2      6),
 ('b',   key1 key2 key3  data1  data2  data3
  2    b  one    c      6      8      1
  3    b  two    d      8      8      6)]

In [6]:
for name,gro in datas:
    print(name)
    print(gro)

a
  key1 key2 key3  data1  data2  data3
0    a  one    a      3      7      2
1    a  two    b      8      7      1
4    a  one    e      6      2      6
b
  key1 key2 key3  data1  data2  data3
2    b  one    c      6      8      1
3    b  two    d      8      8      6

In [7]:
#随机下标
key = [1,2,1,1,2]
data.groupby(key)['data1'].mean()

1    2.666667
2    2.500000
Name: data1, dtype: float64

In [19]:
#聚合
data.groupby('key1').sum()
data.groupby('key1').mean()
data.groupby('key1').max()
data.groupby('key1').min()

      data1  data2  data3 key2 key3
key1
a         1      2      1  one    a
b         1      1      4  one    c

In [22]:
data.groupby('key1')['data1'].sum()
data.groupby('key1')['data1','data2'].sum()
data.groupby(['key1','key2'])['data1','data2'].sum()

           data1  data2
key1 key2
a    one      15     10
     two       1      5
b    one       3      2
     two       1      1

In [39]:
# data['data1'].groupby(data['key2']).sum()
data[['data1','data2']].groupby([data['key2'],data['key1']]).sum()

           data1  data2
key2 key1
one  a        15     10
     b         3      2
two  a         1      5
     b         1      1

自定义聚合

In [40]:
data = np.random.randint(1,10,(4,4))
df1 = pd.DataFrame(data,columns = ['a','b','c','d'])
df1

   a  b  c  d
0  2  9  2  2
1  2  1  8  6
2  8  2  3  6
3  8  8  7  2

In [45]:
df1.apply(lambda x:x*10)
df1['a'].apply(lambda x:x*10)
df1.apply(lambda x:x*10,axis = 1)
df1.loc[1:2].apply(lambda x:x*10,axis = 1)

    a   b   c   d
1  20  10  80  60
2  80  20  30  60

In [49]:
def f1(x):
    return x+10
df1.apply(f1)
df1[['b','c']].apply(f1)
df1.apply(f1,axis = 1)
df1.loc[2:3].apply(f1)

    a   b   c   d
2  18  12  13  16
3  18  18  17  12

In [52]:
#自定义字符串操作拼接
def f2(x,strs):
    return str(x)+strs

df1['a'].apply(f2,args = ('hahaha',))

0    2hahaha
1    2hahaha
2    8hahaha
3    8hahaha
Name: a, dtype: object

练习1

In [65]:
import time
df=pd.DataFrame(np.random.randn(6,4),columns=list('ABCD'))
df['F']=pd.date_range('20180115',periods=6)

def getTime(x):
    time_tup = time.strptime(str(x),'%Y-%m-%d %H:%M:%S')
    return pd.Series(time_tup[0:3],index = ['年','月','日'])


df['F'].apply(getTime)

      年  月   日
0  2018  1  15
1  2018  1  16
2  2018  1  17
3  2018  1  18
4  2018  1  19
5  2018  1  20

In [66]:
#请结合apply与groupy函数完成一下练习
#根据地区进行分组   查看平均年龄和工资
#根据年龄进行分组   查看平均工资
#根据性别进行分组   查看平均工资
#先根据地区，然后在根据性别进行分组，查看各地区不同性别的平均工资
df6 = pd.DataFrame({
    'name':['joe', 'susan', 'anne', 'black', 'monika','ronaldo','leonarldo','tom','yilianna','bulanni'],
    'age':[19,19,18,20,20,18,19,20,18,19],
    'sex':['man','women','women','man','women','man','man','man','women','women'],
    'address':['上海','北京','上海','北京','北京','上海','北京','上海','北京','上海'],
    'money':[8000,8500,7000,9000,10000,7500,8800,9300,12000,11000]
})
df6

  address  age  money       name    sex
0      上海   19   8000        joe    man
1      北京   19   8500      susan  women
2      上海   18   7000       anne  women
3      北京   20   9000      black    man
4      北京   20  10000     monika  women
5      上海   18   7500    ronaldo    man
6      北京   19   8800  leonarldo    man
7      上海   20   9300        tom    man
8      北京   18  12000   yilianna  women
9      上海   19  11000    bulanni  women

In [67]:
def f1(x):
    return x.mean()

def f2(x):
    return x['money'].mean()
#根据地区进行分组   查看平均年龄和工资
print(df6.groupby(['address']).apply(f1))
print('-'*20)
#根据年龄进行分组   查看平均工资
print(df6.groupby(['age'])['money'].apply(f1))
print('-'*20)
#根据性别进行分组   查看平均工资
print(df6.groupby(['sex']).apply(f2))
print('-'*20)
#先根据地区，然后在根据性别进行分组，查看各地区不同性别的平均工资
print(df6.groupby(['address','sex']).apply(f2))

          age   money
address
上海       18.8  8560.0
北京       19.2  9660.0
--------------------
age
18    8833.333333
19    9075.000000
20    9433.333333
Name: money, dtype: float64
--------------------
sex
man      8520.0
women    9700.0
dtype: float64
--------------------
address  sex
上海       man       8266.666667
         women     9000.000000
北京       man       8900.000000
         women    10166.666667
dtype: float64

练习3

In [68]:
df = pd.DataFrame({'性别' : ['男', '女', '男', '女',
                              '男', '女', '男', '男'],
                       '成绩' : ['优秀', '优秀', '及格', '差',
                              '及格', '及格', '优秀', '差'],
                       '年龄' : [15,14,15,12,13,14,15,16]})
df

   年龄 性别  成绩
0  15  男  优秀
1  14  女  优秀
2  15  男  及格
3  12  女   差
4  13  男  及格
5  14  女  及格
6  15  男  优秀
7  16  男   差

In [69]:
GroupBy=df.groupby("性别")
# 根据性别进行成绩排序
for name ,goru in GroupBy:
    print(name)
    print(goru.sort_values(by = '成绩'))

女
   年龄 性别  成绩
1  14  女  优秀
5  14  女  及格
3  12  女   差
男
   年龄 性别  成绩
0  15  男  优秀
6  15  男  优秀
2  15  男  及格
4  13  男  及格
7  16  男   差

In [71]:
#根据性别进行成绩排序
def s(x):
    return x.sort_values(by = '成绩')
df.groupby('性别').apply(s)

      年龄 性别  成绩
性别
女  1  14  女  优秀
   5  14  女  及格
   3  12  女   差
男  0  15  男  优秀
   6  15  男  优秀
   2  15  男  及格
   4  13  男  及格
   7  16  男   差

In [76]:
# 计算男女比例
total = df['性别'].count()
sex_count=df.groupby('性别')['性别'].count()
sex_count.apply(lambda x:str(x/total*100)+'%')

# 计算成绩分布，每个成绩段有多少人

性别
女    37.5%
男    62.5%
Name: 性别, dtype: object

In [82]:
score = df.groupby('成绩')['成绩'].count()
score.apply(lambda x : str(x)+'人')

成绩
优秀    3人
及格    3人
差     2人
Name: 成绩, dtype: object